<a href="https://colab.research.google.com/github/ReemOmer/66daysofdata/blob/main/Day1in66.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Pandas

In [ ]:
import warnings
import pandas as pd

warnings.filterwarnings('ignore')

Pandas is a python package that help in working with labelled and structured data. Pandas deals with series, dataframes and panels.

In [ ]:
# create series with an array
import numpy as np
data = pd.Series(np.array(['test1','test2']))
print(data)

0    test1
1    test2
dtype: object

In [ ]:
# change index of series
data = pd.Series(np.array(['test1','test2']), index=[1,2])
data

1    test1
2    test2
dtype: object

In [ ]:
# creating a series with dictionary
data = {'a':0.,'b':1.,'c':2.}
data = pd.Series(data)

In [ ]:
s = pd.Series(5,index=[0,1,2,3])
s

0    5
1    5
2    5
3    5
dtype: int64

In [ ]:
s = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
print(s[0])
print(s[:2])
print(s[-2:])

1
a    1
b    2
dtype: int64
d    4
e    5
dtype: int64

In [ ]:
data

a    0.0
b    1.0
c    2.0
dtype: float64

### Functions

In [ ]:
print(s.axes)
print(s.values)
print(s.empty)
print(pd.Series().empty)
print(s.ndim) # the default value for series dimension is 1, index is not counted
print(s.size) # the length of the series
print(s.head(2))
print(s.tail(2))

[Index(['a', 'b', 'c', 'd', 'e'], dtype='object')]
[1 2 3 4 5]
False
True
1
5
a    1
b    2
dtype: int64
d    4
e    5
dtype: int64

Series is a type of list in pandas which can take integer values, string values, double values and more. ... Series can only contain single list with index, whereas dataframe can be made of more than one series or we can say that a dataframe is a collection of series that can be used to analyse the data.

Dataframes like SQL or spreadsheets.

In [ ]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [ ]:
df = pd.DataFrame([1,2,3,4,5,6])
print(df)

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [ ]:
mydf = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(mydf, columns=['Name','Age'])
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [ ]:
# create df from dictionary with index

data = {'Name':['Tom','Jack','Steve','Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data,index=['record1','record2','record3','record4'])
df

          Name  Age
record1    Tom   28
record2   Jack   34
record3  Steve   29
record4  Ricky   42

In [ ]:
d = {'one':pd.Series([1,2,3],index=['a','b','c']),'two':pd.Series([1,2,3,4],index=['a','b','c','d'])}

df = pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [ ]:
df['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [ ]:
print(df['one']['c'])
print(df['one'][3])

3.0
nan

In [ ]:
print(df[df['one']>2]) # the returned values are conditioned to be larger than 2

   one  two
c  3.0    3

In [ ]:
df['three'] = pd.Series([10,20,30],index=['a','c','d'])
df

   one  two  three
a  1.0    1   10.0
b  2.0    2    NaN
c  3.0    3   20.0
d  NaN    4   30.0

In [ ]:
# create new column out of the existing ones
df['four'] = df['one']+df['three']
df

   one  two  three  four
a  1.0    1   10.0  11.0
b  2.0    2    NaN   NaN
c  3.0    3   20.0  23.0
d  NaN    4   30.0   NaN

In [ ]:
df

   one  two  three  four
a  1.0    1   10.0  11.0
b  2.0    2    NaN   NaN
c  3.0    3   20.0  23.0
d  NaN    4   30.0   NaN

### Deleting columns

In [ ]:
del df['four']
df

   one  two  three
a  1.0    1   10.0
b  2.0    2    NaN
c  3.0    3   20.0
d  NaN    4   30.0

In [ ]:
df.pop('three')

a    10.0
b     NaN
c    20.0
d    30.0
Name: three, dtype: float64

In [ ]:
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4